<a href="https://colab.research.google.com/github/yagmurtumukluu/data-python/blob/main/ARRAYS_PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

LIST

In [113]:
list = ["tv", "phone", "laptop"]
for esyalar in list:
  print (esyalar)

tv
phone
laptop

In [114]:
print(list[2])

laptop

In [115]:
print(len(list))

3

In [116]:
list2 = [ '[sayi1, sayi2]' , 1, 2]

list2[1]

1

In [117]:
list2.append("devam")
list2

['[sayi1, sayi2]', 1, 2, 'devam']

In [118]:
list2.insert(1, "insert edilen sayi" )

list2

['[sayi1, sayi2]', 'insert edilen sayi', 1, 2, 'devam']

In [119]:
list2.pop(3)
list2

['[sayi1, sayi2]', 'insert edilen sayi', 1, 'devam']

Tuple

In [120]:
tuple1 = ("yagmur", "bulut", "ruzgar")
print(tuple1[0])

yagmur

In [121]:
for x in tuple1:
  print(x)

yagmur
bulut
ruzgar

SET

In [122]:
set1 = {"apple", "banana", "cherry"}
print(set1)

{'cherry', 'apple', 'banana'}

In [123]:
days = set (["monday", "tue", "wed", "thu", "friday", "saturday", "sunday"])


months={"Jan","Feb","Mar"}


dates={21,22,17}

print(days)
print(months)
print(days)

{'saturday', 'friday', 'monday', 'wed', 'thu', 'sunday', 'tue'}
{'Jan', 'Mar', 'Feb'}
{'saturday', 'friday', 'monday', 'wed', 'thu', 'sunday', 'tue'}

DICT:

In [124]:
dict1 = { 
"marka: iphone",
"model: 7plus",
"renk: siyah"
 } 

print(dict1)

{'renk: siyah', 'model: 7plus', 'marka: iphone'}

In [125]:
for x in dict1:
  print(x)

renk: siyah
model: 7plus
marka: iphone

In [126]:
dict1["renk"] = beyaz

print(dict1)

NameError: ignored

# PANDAS

In [127]:
import pandas as pd

from pandas import Series, DataFrame

SERİES:

In [128]:
x = [1,2, 3, 6, 5]

pd.Series(x)

0    1
1    2
2    3
3    6
4    5
dtype: int64

In [129]:
contries = ["turkey", "abd", "german", "england"]

pd.Series(contries)

0     turkey
1        abd
2     german
3    england
dtype: object

In [130]:
cost = {
"turkey": 46523,
"german":98654252,
"abd":897653289,
}

pd.Series(cost)

turkey        46523
german     98654252
abd       897653289
dtype: int64

In [131]:
years = [2015, 2016, 2017, 2018]

cost = [ 1000, 2000, 3000, 4000]

pandas_series =pd.Series (data = cost, index= years)

pandas_series

2015    1000
2016    2000
2017    3000
2018    4000
dtype: int64

In [132]:
print(pandas_series.ndim)

1

In [ ]:
print(pandas_series.shape)

In [133]:
numbers = [ 5, 6, 8, 9 ,65]

pandas_series2 = pd.Series(numbers)


print(pandas_series2.sum())

93

In [134]:
print(pandas_series2.max())

65

In [135]:
print(pandas_series2.mean())

18.6

In [136]:
print(pandas_series2 + pandas_series2)

0     10
1     12
2     16
3     18
4    130
dtype: int64

In [ ]:
import numpy as np
print(np.sqrt(pandas_series2))

In [137]:
print(pandas_series2[pandas_series2>pandas_series2.median()])

3     9
4    65
dtype: int64

DATAFRAME:

In [138]:
dict1 = dict(a=1, b=2, c=3, d=4)
dict2 = dict(a=5, b=6, c=7, d=8, e=9)

data1 = dict(first=dict1, second=dict2)

df1 = pd.DataFrame(data1)

print(df1)

   first  second
a    1.0       5
b    2.0       6
c    3.0       7
d    4.0       8
e    NaN       9

In [139]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [140]:
frame.head

<bound method NDFrame.head of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

CSV:

In [141]:
csv_deneme1 = pd.read_csv('https://sololearn.com/uploads/files/president_heights_party.csv', 
                   index_col='name')
print(csv_deneme1)

                        order  age  height                  party
name
George Washington           1   57     189                   none
John Adams                  2   61     170             federalist
Thomas Jefferson            3   57     189  democratic-republican
James Madison               4   57     163  democratic-republican
James Monroe                5   58     183  democratic-republican
John Quincy Adams           6   57     171  democratic-republican
Andrew Jackson              7   61     185             democratic
Martin Van Buren            8   54     168             democratic
William Henry Harrison      9   68     173                   whig
John Tyler                 10   51     183                   whig
James K. Polk              11   49     173             democratic
Zachary Taylor             12   64     173                   whig
Millard Fillmore           13   50     175                   whig
Franklin Pierce            14   48     178             democratic
James Buchanan             15   65     183             democratic
Abraham Lincoln            16   52     193             republican
Andrew Johnson             17   56     178         national union
Ulysses S. Grant           18   46     173             republican
Rutherford B. Hayes        19   54     174             republican
James A. Garfield          20   49     183             republican
Chester A. Arthur          21   51     183             republican
Grover Cleveland           22   47     180             democratic
Benjamin Harrison          23   55     168             republican
Grover Cleveland           25   55     180             democratic
William McKinley           25   54     170             republican
Theodore Roosevelt         26   42     178             republican
William Howard Taft        27   51     182             republican
Woodrow Wilson             28   56     180             democratic
Warren G. Harding          29   55     183             republican
Calvin Coolidge            30   51     178             republican
Herbert Hoover             31   54     182             republican
Franklin D. Roosevelt      32   51     188             democratic
Harry S. Truman            33   60     175             democratic
Dwight D. Eisenhower       34   62     179             republican
John F. Kennedy            35   43     183             democratic
Lyndon B. Johnson          36   55     193             democratic
Richard Nixon              37   56     182             republican
Gerald Ford                38   61     183             republican
Jimmy Carter               39   52     177             democratic
Ronald Reagan              40   69     185             republican
George H. W. Bush          41   64     188             republican
Bill Clinton               42   46     188             democratic
George W. Bush             43   54     182             republican
Barack Obama               44   47     185             democratic
Donald J. Trump            45   70     191             republican

In [142]:
print(csv_deneme1.shape)

(45, 4)

In [143]:
print(csv_deneme1.shape[0])

45

In [144]:
print(csv_deneme1.head())

                   order  age  height                  party
name
George Washington      1   57     189                   none
John Adams             2   61     170             federalist
Thomas Jefferson       3   57     189  democratic-republican
James Madison          4   57     163  democratic-republican
James Monroe           5   58     183  democratic-republican

In [145]:
print(csv_deneme1.loc['James Monroe'])

order                         5
age                          58
height                      183
party     democratic-republican
Name: James Monroe, dtype: object

In [146]:
print(csv_deneme1.iloc[40])

order             41
age               64
height           188
party     republican
Name: George H. W. Bush, dtype: object

In [ ]:
print(csv_deneme1[['age', 'height']])

In [154]:
csv_deneme1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45 entries, George Washington to Donald J. Trump
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   order   45 non-null     int64
 1   age     45 non-null     int64
 2   height  45 non-null     int64
 3   party   45 non-null     object
dtypes: int64(3), object(1)
memory usage: 3.0+ KB

In [160]:
#eksık degerlerın sayısını gorme

print(csv_deneme1.isnull().sum().sort_values(ascending=False))

party     0
height    0
age       0
order     0
dtype: int64

In [162]:
#istatistiksel deger gorme
print(csv_deneme1.describe())

           order        age      height
count  45.000000  45.000000   45.000000
mean   23.022222  55.000000  180.000000
std    13.136502   6.595453    6.977236
min     1.000000  42.000000  163.000000
25%    12.000000  51.000000  175.000000
50%    23.000000  55.000000  182.000000
75%    34.000000  58.000000  183.000000
max    45.000000  70.000000  193.000000

In [164]:
#Her bir değerin sütunda bulunma sayısı
csv_deneme1["age"].value_counts()

51    5
54    5
57    4
55    4
56    3
61    3
49    2
46    2
47    2
64    2
52    2
50    1
48    1
58    1
60    1
43    1
42    1
70    1
69    1
68    1
65    1
62    1
Name: age, dtype: int64

In [148]:

df1 = pd.DataFrame(np.arange(12.).reshape(3,4), columns= list('abcde'))

df2 = pd.DataFrame(np.arange(20.).reshape(4,5), columns= list('abcde'))


df2.loc[1, 'b'] = np.nan

df1

TypeError: ignored

In [150]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                        index=['a', 'c', 'd'],
                       columns=['Ohio', 'Texas', 'California'])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [152]:
#
frame2  = frame.reindex(['a', 'b', 'c', 'd'])

frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

Dropping Entries from an Axis

In [166]:
obj = pd.Series(np.arange(5,), index=['a', 'b', 'c', 'd', 'e'] )

obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [170]:
new_obj = obj.drop(['a', 'c'])

new_obj

b    1
d    3
e    4
dtype: int64

In [173]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])


data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [184]:
data['Ohio']

KeyError: ignored

In [177]:
new_data = data.drop(['Ohio'])

new_data

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [178]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15


Indexing, Selection, and Filtering

In [ ]:
obj = pd.Series(np.arange(4,) , index= ['a', 'b', 'c', 'd'])

obj

In [ ]:
obj[[1, 3]]

In [ ]:
obj['b', 'c'] = 5

obj

birden fazla satir ve sutun secme

In [190]:
data[['three' , 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [193]:
data[:2]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [194]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
#comparison
data< 5

In [ ]:
data [data>5] = 0

data

LOC AND ILOC

In [200]:
data = frame.iloc[0]

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8